## Data Management and Visualization

### 0. Data

In [2]:
import pandas as pd

In [3]:
house = pd.read_excel ("http://byungwan.com/class/House_Prices.xls")
house.head()

   HomeID   Price  SqFt  Bedrooms  Bathrooms  Offers Brick Neighborhood
0       1  114300  1790         2          2       2    No         East
1       2  114200  2030         4          2       3    No         East
2       3  114800  1740         3          2       1    No         East
3       4   94700  1980         3          2       3    No         East
4       5  119800  2130         3          3       3    No         East

In [ ]:
# in this class; mostly cross-sectional data
# categorical or numerical
## categorical -> nominal / ordinal
    # nominal : having no orders
## numerical -> discrete / continuous

### 1. Creating dummies

#### 1.1. Maps

In [19]:
house_brick1 = house["Brick"].map({"No":0, "Yes":1})
house_brick1
# mapping no -> 0 , yes -> 1
# put this list in the house table
# now put house_brick1 in the table

0      0
1      0
2      0
3      0
4      0
      ..
123    1
124    1
125    0
126    0
127    0
Name: Brick, Length: 128, dtype: int64

In [10]:
house["Brick_Yes"] = house_brick1
# how to create a new column

In [12]:
house.head(10)
# we can see all the categorical variable to numbers
# text to numbers

,HomeID,Price,SqFt,Bedrooms,Bathrooms,Offers,Brick,Neighborhood,Brick_Yes
0,1,114300,1790,2,2,2,No,East,0
1,2,114200,2030,4,2,3,No,East,0
2,3,114800,1740,3,2,1,No,East,0
3,4,94700,1980,3,2,3,No,East,0
4,5,119800,2130,3,3,3,No,East,0
5,6,114600,1780,3,2,2,No,North,0
6,7,151600,1830,3,3,3,Yes,West,1
7,8,150700,2160,4,2,2,No,West,0
8,9,119200,2110,4,2,3,No,East,0
9,10,104000,1730,3,3,3,No,East,0

In [13]:
# instead of using map, we can use get dummies

#### 1.2 Get dummies

In [16]:
pd.get_dummies(house["Brick"], dtype=int)
# we are doing this to convert categorical data -> numbers
# the output datatype should be int
# it creates 2 dummies / "Brick" value can be No, Yes -> so we have 2 columns

     No  Yes
0     1    0
1     1    0
2     1    0
3     1    0
4     1    0
..   ..  ...
123   0    1
124   0    1
125   1    0
126   1    0
127   1    0

[128 rows x 2 columns]

In [21]:
house_brick2 = pd.get_dummies(house["Brick"], dtype=int)["Yes"]
# now it is similar to mapping

In [22]:
house["Brick_Yes2"] = house_brick2

In [23]:
house.head(10)

,HomeID,Price,SqFt,Bedrooms,Bathrooms,Offers,Brick,Neighborhood,Brick_Yes,Brick_Yes2
0,1,114300,1790,2,2,2,No,East,0,0
1,2,114200,2030,4,2,3,No,East,0,0
2,3,114800,1740,3,2,1,No,East,0,0
3,4,94700,1980,3,2,3,No,East,0,0
4,5,119800,2130,3,3,3,No,East,0,0
5,6,114600,1780,3,2,2,No,North,0,0
6,7,151600,1830,3,3,3,Yes,West,1,1
7,8,150700,2160,4,2,2,No,West,0,0
8,9,119200,2110,4,2,3,No,East,0,0
9,10,104000,1730,3,3,3,No,East,0,0

In [28]:
pd.get_dummies(house["Neighborhood"], dtype=int)
# Value is one of the 3, do we need all 3 columns?
# Above, we dropped NO because we already have YES information

# Similarly

     East  North  West
0       1      0     0
1       1      0     0
2       1      0     0
3       1      0     0
4       1      0     0
..    ...    ...   ...
123     1      0     0
124     1      0     0
125     0      1     0
126     0      0     1
127     0      1     0

[128 rows x 3 columns]

In [27]:
house["Neighborhood"].value_counts()

Neighborhood
East     45
North    44
West     39
Name: count, dtype: int64

In [35]:
n_North = pd.get_dummies(house["Neighborhood"], dtype=int)["North"]
n_West = pd.get_dummies(house["Neighborhood"], dtype=int)["West"]

In [36]:
n_West

0      0
1      0
2      0
3      0
4      0
      ..
123    0
124    0
125    0
126    1
127    0
Name: West, Length: 128, dtype: int64

In [37]:
house["Neighborhood_North"] = n_North
house["Neighborhood_West"] = n_West

In [38]:
house.head(10)

,HomeID,Price,SqFt,Bedrooms,Bathrooms,Offers,Brick,Neighborhood,Brick_Yes,Brick_Yes2,Neighborhood_North,Neighborhood_West
0,1,114300,1790,2,2,2,No,East,0,0,0,0
1,2,114200,2030,4,2,3,No,East,0,0,0,0
2,3,114800,1740,3,2,1,No,East,0,0,0,0
3,4,94700,1980,3,2,3,No,East,0,0,0,0
4,5,119800,2130,3,3,3,No,East,0,0,0,0
5,6,114600,1780,3,2,2,No,North,0,0,1,0
6,7,151600,1830,3,3,3,Yes,West,1,1,0,1
7,8,150700,2160,4,2,2,No,West,0,0,0,1
8,9,119200,2110,4,2,3,No,East,0,0,0,0
9,10,104000,1730,3,3,3,No,East,0,0,0,0

#### 1.3

In [41]:
house = pd.read_excel ("http://byungwan.com/class/House_Prices.xls")
house.head()

   HomeID   Price  SqFt  Bedrooms  Bathrooms  Offers Brick Neighborhood
0       1  114300  1790         2          2       2    No         East
1       2  114200  2030         4          2       3    No         East
2       3  114800  1740         3          2       1    No         East
3       4   94700  1980         3          2       3    No         East
4       5  119800  2130         3          3       3    No         East

In [44]:
house2 = pd.get_dummies(house, columns = ["Brick","Neighborhood"], drop_first=True, dtype=int)
house2
# name of variables -> columns = [~~]
# ask to convert everything in house data
# we don't need all columns created for ge_dummies // drop_first -> True

,HomeID,Price,SqFt,Bedrooms,Bathrooms,Offers,Brick_Yes,Neighborhood_North,Neighborhood_West
0,1,114300,1790,2,2,2,0,0,0
1,2,114200,2030,4,2,3,0,0,0
2,3,114800,1740,3,2,1,0,0,0
3,4,94700,1980,3,2,3,0,0,0
4,5,119800,2130,3,3,3,0,0,0
...,...,...,...,...,...,...,...,...,...
123,124,119700,1900,3,3,3,1,0,0
124,125,147900,2160,4,3,3,1,0,0
125,126,113500,2070,2,2,2,0,1,0
126,127,149900,2020,3,3,1,0,0,1
127,128,124600,2250,3,3,4,0,1,0

In [46]:
# Number of dummies = number of categories -1

# Interpretation
## Numerical / coupon = 0.1 * Purchases
    # 수치형 변수는 “횟수나 금액”처럼 연속적이고 크기에 비례해서 쿠폰에 영향을 준다는 걸 보여줍니다
## Categorical / coupon = 0.3 * Gender
    # 범주형 변수는 더미 변수(dummy variable)로 바꿔서 쿠폰에 영향을 준다는 걸 보여줍니다

# For classification models, numerical -> categorical is used a lot

In [53]:
house2.describe()

,HomeID,Price,SqFt,Bedrooms,Bathrooms,Offers,Brick_Yes,Neighborhood_North,Neighborhood_West
count,128.000000,128.000000,128.000000,128.000000,128.000000,128.000000,128.000000,128.000000,128.000000
mean,64.500000,130427.343750,2000.937500,3.023438,2.445312,2.578125,0.328125,0.343750,0.304688
std,37.094474,26868.770371,211.572431,0.725951,0.514492,1.069324,0.471376,0.476825,0.462084
min,1.000000,69100.000000,1450.000000,2.000000,2.000000,1.000000,0.000000,0.000000,0.000000
25%,32.750000,111325.000000,1880.000000,3.000000,2.000000,2.000000,0.000000,0.000000,0.000000
50%,64.500000,125950.000000,2000.000000,3.000000,2.000000,3.000000,0.000000,0.000000,0.000000
75%,96.250000,148250.000000,2140.000000,3.000000,3.000000,3.000000,1.000000,1.000000,1.000000
max,128.000000,211200.000000,2590.000000,5.000000,4.000000,6.000000,1.000000,1.000000,1.000000

In [57]:
house_class1 = pd.cut(house2["Price"], bins = [0, 100000, 300000], labels = ["Low", "High"])
# 0 ~ 100000 -> low, 100000 ~ 300000 -> high

In [58]:
house2["Price_Class1"] = house_class1

In [59]:
house2.head()

,HomeID,Price,SqFt,Bedrooms,Bathrooms,Offers,Brick_Yes,Neighborhood_North,Neighborhood_West,Price_Class1
0,1,114300,1790,2,2,2,0,0,0,High
1,2,114200,2030,4,2,3,0,0,0,High
2,3,114800,1740,3,2,1,0,0,0,High
3,4,94700,1980,3,2,3,0,0,0,Low
4,5,119800,2130,3,3,3,0,0,0,High

In [60]:
house_class2 = pd.cut(house2["Price"], 
                      bins = [0, 100000, 200000, 300000], 
                      labels = ["Low", "Medium", "High"])
# 0 ~ 100000 -> low, 100000 ~ 200000 -> medium, 200000 ~ 300000 -> high

In [61]:
house2["Price_Class2"] = house_class2
house2

,HomeID,Price,SqFt,Bedrooms,Bathrooms,Offers,Brick_Yes,Neighborhood_North,Neighborhood_West,Price_Class1,Price_Class2
0,1,114300,1790,2,2,2,0,0,0,High,Medium
1,2,114200,2030,4,2,3,0,0,0,High,Medium
2,3,114800,1740,3,2,1,0,0,0,High,Medium
3,4,94700,1980,3,2,3,0,0,0,Low,Low
4,5,119800,2130,3,3,3,0,0,0,High,Medium
...,...,...,...,...,...,...,...,...,...,...,...
123,124,119700,1900,3,3,3,1,0,0,High,Medium
124,125,147900,2160,4,3,3,1,0,0,High,Medium
125,126,113500,2070,2,2,2,0,1,0,High,Medium
126,127,149900,2020,3,3,1,0,0,1,High,Medium
127,128,124600,2250,3,3,4,0,1,0,High,Medium

In [62]:
# a different way is to use number for bins
# ex) bins = 2 : instead of specific ranges, just give the number of classes

house_class3 = pd.cut(house2["Price"], 
                      bins = 2, 
                      labels = ["Low", "High"])

In [63]:
house2["Price_Class3"] = house_class3

In [65]:
house2.head(10)

,HomeID,Price,SqFt,Bedrooms,Bathrooms,Offers,Brick_Yes,Neighborhood_North,Neighborhood_West,Price_Class1,Price_Class2,Price_Class3
0,1,114300,1790,2,2,2,0,0,0,High,Medium,Low
1,2,114200,2030,4,2,3,0,0,0,High,Medium,Low
2,3,114800,1740,3,2,1,0,0,0,High,Medium,Low
3,4,94700,1980,3,2,3,0,0,0,Low,Low,Low
4,5,119800,2130,3,3,3,0,0,0,High,Medium,Low
5,6,114600,1780,3,2,2,0,1,0,High,Medium,Low
6,7,151600,1830,3,3,3,1,0,1,High,Medium,High
7,8,150700,2160,4,2,2,0,0,1,High,Medium,High
8,9,119200,2110,4,2,3,0,0,0,High,Medium,Low
9,10,104000,1730,3,3,3,0,0,0,High,Medium,Low

In [67]:
pd.cut(house2["Price"], bins = 2)

# where did 140150 come from? -> it is slightly bigger than the mean
# the pd.cut uses mean average as a threshold

0       (68957.9, 140150.0]
1       (68957.9, 140150.0]
2       (68957.9, 140150.0]
3       (68957.9, 140150.0]
4       (68957.9, 140150.0]
               ...
123     (68957.9, 140150.0]
124    (140150.0, 211200.0]
125     (68957.9, 140150.0]
126    (140150.0, 211200.0]
127     (68957.9, 140150.0]
Name: Price, Length: 128, dtype: category
Categories (2, interval[float64, right]): [(68957.9, 140150.0] < (140150.0, 211200.0]]

In [68]:
house2["Price_Class3"].value_counts()

Price_Class3
Low     82
High    46
Name: count, dtype: int64

In [71]:
# we can use q.cut() quantile cut and do the same thing

house_class4 = pd.qcut(house2["Price"], 2, labels = ["Low","High"])

In [72]:
house2["Price_Class4"] = house_class4

In [74]:
house2.head()

,HomeID,Price,SqFt,Bedrooms,Bathrooms,Offers,Brick_Yes,Neighborhood_North,Neighborhood_West,Price_Class1,Price_Class2,Price_Class3,Price_Class4
0,1,114300,1790,2,2,2,0,0,0,High,Medium,Low,Low
1,2,114200,2030,4,2,3,0,0,0,High,Medium,Low,Low
2,3,114800,1740,3,2,1,0,0,0,High,Medium,Low,Low
3,4,94700,1980,3,2,3,0,0,0,Low,Low,Low,Low
4,5,119800,2130,3,3,3,0,0,0,High,Medium,Low,Low

In [76]:
house2["Price_Class4"].value_counts()

# using median -> same number of observation

Price_Class4
Low     64
High    64
Name: count, dtype: int64

In [78]:
pd.qcut(house2["Price"], 2)

# exactly same to the median number

0      (69099.999, 125950.0]
1      (69099.999, 125950.0]
2      (69099.999, 125950.0]
3      (69099.999, 125950.0]
4      (69099.999, 125950.0]
               ...
123    (69099.999, 125950.0]
124     (125950.0, 211200.0]
125    (69099.999, 125950.0]
126     (125950.0, 211200.0]
127    (69099.999, 125950.0]
Name: Price, Length: 128, dtype: category
Categories (2, interval[float64, right]): [(69099.999, 125950.0] < (125950.0, 211200.0]]